#1.	Вывести на экран горизонтальную линию из звёздочек. Число звездочек указывает пользователь.

N = int(input('Ведите натуральное число: '))
print('*'*N)

